### Terraform `plan` Succeeded for Workspace: `testing`
<details><summary>Show Output</summary>

```
[command]/home/runner/work/_temp/4a8a7ead-6f3a-41c7-9ec5-fd34056903de/terraform-bin plan -var-file=vars/test.tfvars -var-file=vars/test-vpc.tfvars -var-file=vars/test.tfvars -lock=false -input=false random_pet.eks: Refreshing state... [id=test] data.github_team.owner: Reading... data.aws_caller_identity.test: Reading... data.aws_caller_identity.test: Read complete after 0s [id=test_account] data.aws_iam_policy_document.eks_admin_arp: Reading... aws_secretsmanager_secret.gh_read_token[0]: Refreshing state... [id=arn:aws:secretsmanager:test_region:test_account_2:secret:test_secret_4] aws_secretsmanager_secret.github_app_id[0]: Refreshing state... [id=arn:aws:secretsmanager:test_region:test_account_2:secret:github-app-id-s3Tr30] aws_secretsmanager_secret.github_app_pem_file[0]: Refreshing state... [id=arn:aws:secretsmanager:test_region:test_account_2:secret:test_secret_2] module.eks_vpc.data.aws_vpc_endpoint_service.s3[0]: Reading... data.aws_iam_policy_document.eks_admin_arp: Read complete after 0s [id=test_id] module.eks[0].module.kms.data.aws_caller_identity.current: Reading... aws_secretsmanager_secret.gh_devops_token[0]: Refreshing state... [id=arn:aws:secretsmanager:test_region:test_account_2:secret:github-devops-token-eNlLKE] aws_secretsmanager_secret.gh_pull_access_token[0]: Refreshing state... Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols: + create Terraform will perform the following actions:  # aws_s3_bucket.test[0] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-0" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[1] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-1" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[2] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-2" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[3] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-3" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[4] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-4" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[5] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-5" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[6] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-6" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[7] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-7" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[8] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-8" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[9] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-9" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[10] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-10" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[11] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-11" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[12] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-12" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[13] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-13" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[14] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-14" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[15] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-15" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[16] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-16" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[17] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-17" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[18] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-18" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[19] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-19" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[20] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-20" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[21] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-21" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[22] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-22" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[23] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-23" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[24] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-24" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[25] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-25" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[26] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-26" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[27] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-27" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[28] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-28" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[29] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-29" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[30] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-30" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[31] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-31" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[32] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-32" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[33] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-33" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[34] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-34" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[35] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-35" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[36] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-36" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[37] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-37" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[38] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-38" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[39] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-39" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[40] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-40" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[41] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-41" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[42] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-42" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[43] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-43" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[44] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-44" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[45] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-45" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[46] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-46" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[47] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-47" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[48] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-48" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[49] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-49" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[50] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-50" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[51] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-51" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[52] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-52" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[53] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-53" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[54] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-54" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[55] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-55" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[56] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-56" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[57] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-57" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[58] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-58" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[59] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-59" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[60] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-60" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[61] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-61" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[62] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-62" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[63] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-63" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[64] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-64" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[65] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-65" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[66] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf-test-bucket-66" + bucket_domain_name = (known after apply) + bucket_prefix = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + object_lock_enabled = (known after apply) + policy = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags_all = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) }  # aws_s3_bucket.test[67] will be created  + resource "aws_s3_bucket" "test" { + acceleration_status = (known after apply) + acl = (known after apply) + arn = (known after apply) + bucket = "my-tf
```
</details>